FV2404/E_1006.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">Sperrprozesse Gas</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">19.4.1: AD: Stornieren der Unterbrechung und Wiederherstellung der Anschlussnutzung auf Anweisung des LF</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7a8da1", label=<<B>E_1006</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>10: </B>Wurde der Sperr- / Entsperrauftrag bereits durch den NB abgelehnt?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A06</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Auftrag wurde bereits abgelehnt und kann nicht mehr storniert werden<BR align="left"/></FONT>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>20: </B>Handelt es sich um eine Stornierung eines Entsperrauftrags?<BR align="left"/>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>30: </B>Ist die Stornierung vor der Durchführung der Entsperrung eingegangen?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A01</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Entsperrauftrag ist storniert.<BR align="left"/></FONT>>];
    "A02" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A02</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Stornierung des Entsperrauftrags nicht mehr möglich.<BR align="left"/></FONT>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>40: </B>Ist der Nachrichteneingang der Stornierung spätestens am Tag vor dem vom NB<BR align="left"/>geplanten Ausführungstermin bzw. fixen Sperrtermin aus dem Sperrauftrag<BR align="left"/>eingegangen?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A03</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Sperrauftrag ist bis zum Vortag der Sperrung storniert.<BR align="left"/></FONT>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>50: </B>Ist die Stornierung vor der Durchführung der Sperrung eingegangen?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A04</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Sperrauftrag ist am Tag der Sperrung storniert.<BR align="left"/></FONT>>];
    "A05" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A05</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Stornierung des Sperrauftrags nicht mehr möglich.<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "A06" [label=<<B>JA</B>>, color="#7aab8a"];
    "10" -> "20" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "20" -> "30" [label=<<B>JA</B>>, color="#7aab8a"];
    "20" -> "40" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "30" -> "A01" [label=<<B>JA</B>>, color="#7aab8a"];
    "30" -> "A02" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "40" -> "A03" [label=<<B>JA</B>>, color="#7aab8a"];
    "40" -> "50" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "50" -> "A04" [label=<<B>JA</B>>, color="#7aab8a"];
    "50" -> "A05" [label=<<B>NEIN</B>>, color="#7aab8a"];

    bgcolor="transparent";
}
